tap "azure/kubelogin"
tap "homebrew/bundle"
tap "nikolaeu/numi"
tap "warpdotdev/warp"
# Portable ASCII art graphics library
brew "aalib"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU binary tools for native development
brew "binutils"
# Python code formatter
brew "black"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Object-file caching compiler wrapper
brew "ccache"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# CPU architecture fetching tool
brew "cpufetch"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Network authentication protocol
brew "krb5"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line tool for DigitalOcean
brew "doctl"
# GNU Emacs text editor
brew "emacs"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ping, but with a graph
brew "gping"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Pager program similar to more
brew "less"
# Postgres C API library
brew "libpq"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# LLVM Project Linker
brew "lld"
# Rainbows and unicorns in your console!
brew "lolcat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Quickly generate a temporary email address
brew "mailsy"
# Mac App Store command-line interface
brew "mas"
# Experimental optional static type checker for Python
brew "mypy"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Recreates the SETEC ASTRONOMY effect from 'Sneakers'
brew "no-more-secrets"
# Command-line Git information tool
brew "onefetch"
# Open source suite of directory software
brew "openldap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Modern replacement for ps written in Rust
brew "procs"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Program that allows you to count code, quickly
brew "tokei"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Modern watch command
brew "viddy"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Python-powered, cross-platform, Unix-gazing shell language and command prompt
brew "xonsh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Screen recording software
cask "cap"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Video and audio player
cask "elmedia-player"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Desktop automation application
cask "hammerspoon"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source keystroke visualiser
cask "keycastr"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Calculator and converter application
cask "numi"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Command-line interface to Warp agents
cask "warp-cli"
# Wine wrapper built with SwiftUI
cask "whisky"
# Cloud storage
cask "yandex-disk"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "Data Jar", id: 1453273600
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "GrandPerspective", id: 1111570163
mas "Hidden Bar", id: 1452453066
mas "Jump Desktop", id: 524141863
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "PreviewText", id: 1660037028
mas "Shazam", id: 897118787
mas "Things", id: 904280696
mas "Toggl Track", id: 1291898086
mas "ToothFairy", id: 1191449274
mas "Userscripts", id: 1463298887
mas "Velja", id: 1607635845
vscode "74th.monokai-charcoal-high-contrast"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "andenetalexander.vim-cheatsheet"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "britesnow.vscode-toggle-quotes"
vscode "carlos18mz.cyberpunk-2077-rebuild"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "endormi.2077-theme"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "evondev.dracula-high-contrast"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "idleberg.applescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jnoortheen.xonsh"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "michead.vscode-mesh-viewer"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "patbenatar.advanced-new-file"
vscode "peterschmalfeldt.explorer-exclude"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "redhat.vscode-yaml"
vscode "rocketseat.theme-omni"
vscode "silesky.toggle-boolean"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
